Java/java_examples Hyd/software/xml/soap/soap3.txt

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><inet:product xmlns:inet="http://www.inet.com/contents"><ProdName>Pen</ProdName><Price>10</Price></inet:product><soap-env:Fault><faultcode>FC-400</faultcode><faultactor>http://www.inet.com/res</faultactor><faultstring>problem with the server, try later</faultstring></soap-env:Fault></soap-env:Body></soap-env:Envelope>